app/views/carts/_cart.html.erb

<!-- MA cannot use create.js.rjs in RAILS 3.1 Scott mentioned moustache as alternative (uses curly brackets) - used code on page 150 so cart just appears instead of nice AJAX effect -->
<% unless cart.line_items.empty? %>
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 4