app/controllers/line_items_controller.rb

INSERT INTO "line_items" ("cart_id", "created_at", "order_id", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cart_id", 76], ["created_at", Wed, 19 Oct 2011 16:29:53 UTC +00:00], ["order_id", nil], ["product_id", 9], ["quantity", 1], ["updated_at", Wed, 19 Oct 2011 16:29:53 UTC +00:00]]
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2011-10-11 15:15:48.998482' WHERE "line_items"."id" = 6
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save

SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "140"]]
UPDATE "line_items" SET "quantity" = 1, "updated_at" = '2011-10-18 17:00:30.760962' WHERE "line_items"."id" = 141
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 140]]
---
  def decrement
    @cart = current_cart
    @line_item = LineItem.find(params[:id])
    if @line_item.quantity > 1
      @line_item.update_attribute(:quantity, @line_item.quantity - 1)
    else
      @line_item.destroy