app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "207281424"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Mon, 10 Oct 2011 16:34:01 UTC +00:00], ["updated_at", Mon, 10 Oct 2011 16:34:01 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?)  [["cart_id", 980190963], ["created_at", Wed, 12 Oct 2011 09:50:41 UTC +00:00], ["product_id", 207281424], ["quantity", 1], ["updated_at", Wed, 12 Oct 2011 09:50:41 UTC +00:00]]
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save

SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 980190962]]
---
  def destroy
    # Chris added the instance variable @cart to the destroy instance method so that we can use the destroy method with @cart
    @cart = current_cart
    @line_item = LineItem.find(params[:id])
    @line_item.destroy