app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" ORDER BY created_at desc LIMIT 10 OFFSET 0
---
  def index
    # MA This is using the gem will_paginate to only display 10 orders per page in ATOM feed and/or http://localhost:3000/orders?
    @orders = Order.paginate :page=>params[:page], :order=>'created_at desc', :per_page => 10

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 74
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = 74
---
  def new
    # MA - added below to check if the cart is empty so that prevents the customer from placing blank orders - page 160
    @cart = current_cart
      if @cart.line_items.empty?

INSERT INTO "orders" ("address", "created_at", "email", "name", "pay_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 74]]
SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = 74
---
  def create
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(current_cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
        session[:cart_id] = nil
        Notifier.order_received(@order).deliver # inserted to create/send emails having just set up the template and mailer method - page 185