app/controllers/products_controller.rb

UPDATE "products" SET "image_url" = '/images/rails.png', "updated_at" = '2011-10-07 10:45:29.575971' WHERE "products"."id" = 8
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])

SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY title LIMIT 1  [["id", "3"]]
---
  def who_bought
    @product = Product.find(params[:id])