app/controllers/store_controller.rb

SELECT "products".* FROM "products" ORDER BY title
---
  def index
# MA added session to record how many times user has accessed the index action - page 125
    @products = Product.all